# file = open('sample-x.txt', 'x') # създава го и ако същестувава дай грешка
                                    # zaduljitelno


# file = open('sample-w.txt', 'w') # създава нов или го презаписва не дава грешка
                                    # ако съществува го презаписва  overwrite

# file = open('sample-a.txt', 'a') # ако файлът не съшествува го създай
                                 # ако съществува не го зачиства ами продължава да го записва
                                 # append





